# **20.06.2024 Class 11**

# **Pandas**
## What does Pandas do?

It's Data Manipulatin Library, it preprocessosing and analyzing data.

In [6]:
# to install Pandas write it in terminal
# pip install pandas 

# to import pandas
import pandas as pd

In [7]:
import numpy as np


### Preprocessing Data?
- Cleaning
- Finding Duplicates
- Changing data types : Columns
- Adding and removing columns
- Ploting charts


### Analyzing Data?
- Finding Central Tendencies
- Grouping  the data
- Finding Distribution
- Describing Data
- Pivoting the Data
- Finding correlation between columns.

### Types of datatypes in Pandas?
Series (always 1D array) and Dataframes (always 2D #d array)

> for string in pandas are operated under object data type.

#### Creating Series ?

In [8]:
ls = [45,23,98,46,12,9,1]
s1 = pd.Series(ls)
s1

0    45
1    23
2    98
3    46
4    12
5     9
6     1
dtype: int64

In [9]:
s1.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
s1. values

array([45, 23, 98, 46, 12,  9,  1], dtype=int64)

In [13]:
months = ['Jan', 'Feb', 'Mar', 'Apr', "May"]
s2 = pd.Series(months)
s2

0    Jan
1    Feb
2    Mar
3    Apr
4    May
dtype: object

In [17]:
dateOfMonths = pd.Series([31,28,31,30,31], index = ['Jan', 'Feb', 'Mar', 'Apr', "May"])
dateOfMonths

Jan    31
Feb    28
Mar    31
Apr    30
May    31
dtype: int64

In [18]:
dateOfMonths.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May'], dtype='object')

In [19]:
dateOfMonths.values

array([31, 28, 31, 30, 31], dtype=int64)

In [22]:
s3 = pd.Series([1,2,3,4,5,6])
s3

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [29]:
s3.index = ["A","B","C","D","E","F"]  #type:ignore
s3

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

#### Creating Dataframes?

##### Dictionary of list to Df?

In [27]:
dictOfList = {
    "name":["ram", 'sham', 'sita','gita','ramesh','suresh'],
    'city':['Pune', 'satara', 'auragabad','mumbai','nagpur','kolhapur'],
    'contact':[34553,76575,22433,98779,56455,23334],
    'data_admin':['data_analytics', 'data_science','data_warehousing',
                   'data_admin', 'big_data_analytics','data_engineering']
}

In [28]:
df1 = pd.DataFrame(dictOfList)
df1

     name       city  contact          data_admin
0     ram       Pune    34553      data_analytics
1    sham     satara    76575        data_science
2    sita  auragabad    22433    data_warehousing
3    gita     mumbai    98779          data_admin
4  ramesh     nagpur    56455  big_data_analytics
5  suresh   kolhapur    23334    data_engineering

##### List of Dictiionary to Df?

In [34]:
listOfDict =[
    {'Name':"ram", 'month':'january','sales':56676},
    {'Name': 'sham', 'month':'january', 'sales':54676},
    {'Name':'sita', 'month':'february','sales': 89676}
]

df2 = pd.DataFrame(listOfDict)
df2

   Name     month  sales
0   ram   january  56676
1  sham   january  54676
2  sita  february  89676

## open .csv and .xlsx with pandas?

In [36]:
df4 = pd.read_csv(r'files/csv_file.csv')
df4

   ID    Name   Sales
0   1     Ram  626000
1   2    Sham  567000
2   3    Sita  279000
3   4    Gita  765000
4   5  Ramesh  241000
5   6  Suresh  624000
6   7    Hema  196000
7   8   Rekha  708000
8   9    Jaya  867000
9  10  Sushma  957000

In [41]:
df5 = pd.read_excel(r'files/excel_file.xlsx')
df5

   ID    Name        City Course
0   1     Ram      Mumbai     DA
1   2    Sham        Pune     DS
2   3    Sita      Mumbai     DS
3   4    Gita  Aurangabad     DS
4   5  Ramesh      Nagpur     DA
5   6  Suresh      Satara     DS
6   7    Hema      Satara     DS
7   8   Rekha        Pune     DA
8   9    Jaya  Aurangabad     DA
9  10  Sushma      Nagpur     DA